<?php


// ###
namespace x51\functions;

// /###

/* функции экспорта данных */

class funcImportExportData
{
	/* функции экспорта/импорта данных БД в виде двумерного массива
	структура БД
	таблица с данными $tbl_data которые имеют ключевое поле с именем $fn_data_dui
	таблица категорий $tbl_category которые имеют ключевое поле с именем $fn_category_cui и поле $fn_category_parent которое служит указателем на родительскую категорию
	таблица связи между категориями и данными $tbl_link в которой поле $fn_link_dui содержит идентиф данных, а поле $fn_link_cui содержит идентиф категории
	*/
	
	
	
} // end class
?>